def area(a, b):
    '''
    Возвращает площадь прямоугольника со сторонами длины a и b.

        Параметры:
            a (int/float): длина прямоугольника
            b (int/float): ширина прямоугольника

        Возвращаемое значение:
            a * b (int/float): площадь прямоугольника
    '''
    return a * b

def perimeter(a, b):
    '''
    Возвращает периметр прямоугольника со сторонами длины a и b.

        Параметры:
            a (int/float): длина прямоугольника
            b (int/float): ширина прямоугольника

        Возвращаемое значение:
            a * 2 + b * 2 (int/float): периметр прямоугольника
    '''
    return a * 2 + b * 2
