def area(a, b):
    '''
    Возвращает площадь прямоугольника со сторонами длины a и b.

        Параметры:
            a (float): сторона прямоугольника
            b (float): сторона прямоугольника, прилежащая к стороне а

        Возвращаемое значение:
            a * b (float): площадь прямоугольника
    '''
    return a * b

def perimeter(a, b):
    '''
    Возвращает периметр прямоугольника со сторонами длины a и b.

        Параметры:
            a (float): сторона прямоугольника
            b (float): сторона прямоугольника, прилежащая к стороне а

        Возвращаемое значение:
            a * 2 + b * 2 (float): периметр прямоугольника
    '''
    return a * 2 + b * 2
